seanmlyons22/ti-lprf-pacs/svds/cc13x2x7_cc26x2x7.svd
Note: This bitfield should be set to the same as DCDC_ACTIVE</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PWRSTAT</name>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <description>AON Power and Reset Status

This register is used to monitor various power management related signals in AON.  All other signals than JTAG_PD_ON, AUX_BUS_RESET_DONE, and AUX_RESET_DONE are for test, calibration and debug purpose only.</description>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>[31:3] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>29</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>JTAG_PD_ON</name>
              <description>[2:2] Indicates JTAG power state:

0: JTAG is powered off
1: JTAG is powered on</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>AUX_BUS_RESET_DONE</name>
              <description>[1:1] Indicates Reset Done from AUX Bus:

0: AUX Bus is being reset
1: AUX Bus reset is released</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>AUX_RESET_DONE</name>
              <description>[0:0] Indicates Reset Done from AUX:

0: AUX is being reset
1: AUX reset is released</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x3C00003</resetValue>
        </register>
        <register>
          <name>SHUTDOWN</name>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <description>Shutdown Control

This register contains bitfields required for entering shutdown mode</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>EN</name>
              <description>[0:0] Shutdown control.

0: Do not write 0 to this bit.
1: Immediately start the process to enter shutdown mode</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RECHARGECFG</name>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <description>Recharge Controller Configuration

This register sets all relevant parameters for controlling the recharge algorithm.</description>
          <fields>
            <field>
              <name>MODE</name>
              <description>[31:30] Selects recharge algorithm for VDDR when the system is running on the uLDO</description>
              <bitWidth>2</bitWidth>
              <bitOffset>30</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMPARATOR</name>
                  <value>3</value>
                  <description>External recharge comparator.
Note that the clock to the recharge comparator must be enabled, [ANATOP_MMAP:ADI_3_REFSYS:CTL_RECHARGE_CMP0:COMP_CLK_DISABLE], before selecting  this recharge algorithm.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADAPTIVE</name>
                  <value>2</value>
                  <description>Adaptive timer</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STATIC</name>
                  <value>1</value>
                  <description>Static timer</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <value>0</value>
                  <description>Recharge disabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED24</name>
              <description>[29:24] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>C2</name>
              <description>[23:20] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>20</bitOffset>
            </field>
            <field>
              <name>C1</name>
              <description>[19:16] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>MAX_PER_M</name>
              <description>[15:11] Internal. Only to be used through TI provided API.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>MAX_PER_E</name>
              <description>[10:8] Internal. Only to be used through TI provided API.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>PER_M</name>
              <description>[7:3] Internal. Only to be used through TI provided API.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>PER_E</name>
              <description>[2:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xC0000000</resetValue>
        </register>
        <register>
          <name>RECHARGESTAT</name>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <description>Recharge Controller Status

This register controls various status registers which are updated during recharge.  The register is mostly intended for test and debug.</description>
          <fields>
            <field>
              <name>RESERVED20</name>
              <description>[31:20] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>12</bitWidth>
              <bitOffset>20</bitOffset>
            </field>
            <field>
              <name>VDDR_SMPLS</name>
              <description>[19:16] The last 4 VDDR samples.

For each bit:
0: VDDR was below VDDR_OK threshold when recharge started
1: VDDR was above VDDR_OK threshold when recharge started

