seanmlyons22/ti-lprf-pacs/svds/cc13x2x7_cc26x2x7.svd
An event will be scheduled to occur as soon as possible when writing to CH0CMP provided that the channels is enabled and the new value matches any time between next  RTC value and 1 second in the past.

Writing 1 clears this flag.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>SEC</name>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <description>Second Counter Value, Integer Part</description>
          <fields>
            <field>
              <name>VALUE</name>
              <description>[31:0] Unsigned integer representing Real Time Clock in seconds.

When reading this register the content of SUBSEC.VALUE is simultaneously latched. A consistent reading of the combined Real Time Clock can be obtained by first reading this register, then reading SUBSEC register.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>SUBSEC</name>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <description>Second Counter Value, Fractional Part</description>
          <fields>
            <field>
              <name>VALUE</name>
              <description>[31:0] Unsigned integer representing Real Time Clock in fractions of a second (VALUE/2^32 seconds) at the time when SEC register was read.

Examples :
- 0x0000_0000 = 0.0 sec
- 0x4000_0000 = 0.25 sec
- 0x8000_0000 = 0.5 sec
- 0xC000_0000 = 0.75 sec</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>SUBSECINC</name>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <description>Subseconds Increment
Value added to SUBSEC.VALUE on every SCLK_LFclock cycle.</description>
          <fields>
            <field>
              <name>RESERVED24</name>
              <description>[31:24] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>VALUEINC</name>
              <description>[23:0] This value compensates for a SCLK_LF clock which has an offset from 32768 Hz.

The compensation value can be found as 2^38 / freq, where freq is SCLK_LF clock frequency in Hertz

This value is added to SUBSEC.VALUE on every cycle, and carry of this is added to SEC.VALUE. To perform the addition, bits [23:6] are aligned with SUBSEC.VALUE bits [17:0]. The remaining bits [5:0] are accumulated in a hidden 6-bit register that generates a carry into the above mentioned addition on overflow.
The default value corresponds to incrementing by precisely 1/32768 of a second.

NOTE: This register is read only. Modification of the register value must be done using registers AUX_SYSIF:RTCSUBSECINC0 ,  AUX_SYSIF:RTCSUBSECINC1 and  AUX_SYSIF:RTCSUBSECINCCTL</description>
              <bitWidth>24</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x800000</resetValue>
        </register>
        <register>
          <name>CHCTL</name>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <description>Channel Configuration</description>
          <fields>
            <field>
              <name>RESERVED19</name>
              <description>[31:19] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>13</bitWidth>
              <bitOffset>19</bitOffset>
            </field>
            <field>
              <name>CH2_CONT_EN</name>
              <description>[18:18] Set to enable continuous operation of Channel 2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>18</bitOffset>
            </field>
            <field>
              <name>RESERVED17</name>
              <description>[17:17] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>17</bitOffset>
            </field>
            <field>
              <name>CH2_EN</name>
              <description>[16:16] RTC Channel 2 Enable

0: Disable RTC Channel 2
1: Enable RTC Channel 2</description>
              <bitWidth>1</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>RESERVED10</name>
              <description>[15:10] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>CH1_CAPT_EN</name>
              <description>[9:9] Set Channel 1 mode

0: Compare mode (default)
1: Capture mode</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>CH1_EN</name>
              <description>[8:8] RTC Channel 1 Enable

0: Disable RTC Channel 1
1: Enable RTC Channel 1</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>[7:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>CH0_EN</name>
              <description>[0:0] RTC Channel 0 Enable

0: Disable RTC Channel 0
1: Enable RTC Channel 0</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>CH0CMP</name>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <description>Channel 0 Compare Value</description>
          <fields>
            <field>
              <name>VALUE</name>
              <description>[31:0] RTC Channel 0 compare value.

Bit 31 to 16 represents seconds and bits 15 to 0 represents subseconds of the compare value.

