seanmlyons22/ti-lprf-pacs/svds/cc13x2x7_cc26x2x7.svd
To avoid glitches on AUXIO[8i+6] you must configure this register while IOPOE bit 6 is 0.

In the formulas i = 0 for AUX_AIODIO0, i = 1 for AUX_AIODIO1, and so forth.</description>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>[31:3] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>29</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>SRC</name>
              <description>[2:0] Select a peripheral signal that connects to AUXIO[8i+6] when IOPOE bit 6 is set.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AUX_TIMER2_PULSE</name>
                  <value>7</value>
                  <description>Peripheral output mux selects asynchronous version of AUX_EVCTL:EVSTAT3.AUX_TIMER2_PULSE.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER2_EV3</name>
                  <value>6</value>
                  <description>Peripheral output mux selects asynchronous version of AUX_EVCTL:EVSTAT3.AUX_TIMER2_EV3.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER2_EV2</name>
                  <value>5</value>
                  <description>Peripheral output mux selects asynchronous version of AUX_EVCTL:EVSTAT3.AUX_TIMER2_EV2.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER2_EV1</name>
                  <value>4</value>
                  <description>Peripheral output mux selects asynchronous version of AUX_EVCTL:EVSTAT3.AUX_TIMER2_EV1.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER2_EV0</name>
                  <value>3</value>
                  <description>Peripheral output mux selects asynchronous version of AUX_EVCTL:EVSTAT3.AUX_TIMER2_EV0.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_SPIM_MOSI</name>
                  <value>2</value>
                  <description>Peripheral output mux selects AUX_SPIM MOSI.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_SPIM_SCLK</name>
                  <value>1</value>
                  <description>Peripheral output mux selects AUX_SPIM SCLK.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_EV_OBS</name>
                  <value>0</value>
                  <description>Peripheral output mux selects event selected by AUX_EVCTL:EVOBSCFG</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>IO7PSEL</name>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <description>Input Output 7 Peripheral Select

This register selects a peripheral signal that connects to AUXIO[8i+7] when IOPOE bit 7 is 1.

To avoid glitches on AUXIO[8i+7] you must configure this register while IOPOE bit 7 is 0.

In the formulas i = 0 for AUX_AIODIO0, i = 1 for AUX_AIODIO1, and so forth.</description>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>[31:3] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>29</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>SRC</name>
              <description>[2:0] Select a peripheral signal that connects to AUXIO[8i+7] when IOPOE bit 7 is set.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AUX_TIMER2_PULSE</name>
                  <value>7</value>
                  <description>Peripheral output mux selects asynchronous version of AUX_EVCTL:EVSTAT3.AUX_TIMER2_PULSE.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER2_EV3</name>
                  <value>6</value>
                  <description>Peripheral output mux selects asynchronous version of AUX_EVCTL:EVSTAT3.AUX_TIMER2_EV3.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER2_EV2</name>
                  <value>5</value>
                  <description>Peripheral output mux selects asynchronous version of AUX_EVCTL:EVSTAT3.AUX_TIMER2_EV2.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER2_EV1</name>
                  <value>4</value>
                  <description>Peripheral output mux selects asynchronous version of AUX_EVCTL:EVSTAT3.AUX_TIMER2_EV1.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER2_EV0</name>
                  <value>3</value>
                  <description>Peripheral output mux selects asynchronous version of AUX_EVCTL:EVSTAT3.AUX_TIMER2_EV0.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_SPIM_MOSI</name>
                  <value>2</value>
                  <description>Peripheral output mux selects AUX_SPIM MOSI.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_SPIM_SCLK</name>
                  <value>1</value>
                  <description>Peripheral output mux selects AUX_SPIM SCLK.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_EV_OBS</name>
                  <value>0</value>
                  <description>Peripheral output mux selects event selected by AUX_EVCTL:EVOBSCFG</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>IOMODEL</name>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <description>Input Output Mode Low

This is an alias register for IOMODE.IO0 thru IOMODE.IO3.</description>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>IO3</name>
              <description>[7:6] See IOMODE.IO3.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>IO2</name>
              <description>[5:4] See IOMODE.IO2.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>IO1</name>
              <description>[3:2] See IOMODE.IO1.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>IO0</name>
              <description>[1:0] See IOMODE.IO0.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>IOMODEH</name>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <description>Input Output Mode High

This is an alias register for IOMODE.IO4 thru IOMODE.IO7.</description>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>IO7</name>
              <description>[7:6] See IOMODE.IO7.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>IO6</name>
              <description>[5:4] See IOMODE.IO6.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>IO5</name>
              <description>[3:2] See IOMODE.IO5.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>IO4</name>
              <description>[1:0] See IOMODE.IO4.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
