seanmlyons22/ti-lprf-pacs/svds/cc13x2x7_cc26x2x7.svd
16-bit user defined pipeline compare value or channel-updated capture value.

Compare mode:
An update of VALUE will be transferred to CH1CC.VALUE when the next CNTR.VALUE is zero and CTL.MODE is different from DIS. This is useful for PWM generation and prevents jitter on the edges of the generated signal.

Capture mode:
When CH1EVCFG.CCACT equals PER_PULSE_WIDTH_MEAS then VALUE contains the width of the low or high phase of the selected signal. This is specified by CH1CCFG.EDGE and CH1CCFG.CAPT_SRC.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>CH1CC</name>
          <addressOffset>0x9c</addressOffset>
          <size>32</size>
          <description>Channel 1 Capture Compare</description>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>VALUE</name>
              <description>[15:0] Capture Compare value.

16-bit user defined compare value or channel-updated capture value.

Compare mode:
VALUE is compared against CNTR.VALUE and an event is generated as specified by CH1EVCFG.CCACT when these are equal.

Capture mode:
The current counter value is stored in VALUE when a capture event occurs. CH1EVCFG.CCACT determines if VALUE is a signal period or a regular capture value.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>CH2EVCFG</name>
          <addressOffset>0xa0</addressOffset>
          <size>32</size>
          <description>Channel 2 Event Configuration

This register configures channel function and enables event outputs.

Each channel has an edge-detection circuit with memory. The circuit is:
 - enabled while CCACT selects a capture function and CTL.MODE is different from DIS.
 - flushed while CCACT selects a capture function and you change CTL.MODE from DIS to another mode.

The flush action uses two AUX_SYSIF:TIMER2CLKCTL.SRC clock periods. It prevents capture events caused by expired signal values stored in the edge-detection circuit.</description>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>EV3_GEN</name>
              <description>[7:7] Event 3 enable.

0: Channel 2 does not control event 3.
1: Channel 2 controls event 3.

 When 0 &lt; CCACT &lt; 8, EV3_GEN becomes zero after a capture or compare event.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>EV2_GEN</name>
              <description>[6:6] Event 2 enable.

0: Channel 2 does not control event 2.
1: Channel 2 controls event 2.

 When 0 &lt; CCACT &lt; 8, EV2_GEN becomes zero after a capture or compare event.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>EV1_GEN</name>
              <description>[5:5] Event 1 enable.

0: Channel 2 does not control event 1.
1: Channel 2 controls event 1.

 When 0 &lt; CCACT &lt; 8, EV1_GEN becomes zero after a capture or compare event.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>EV0_GEN</name>
              <description>[4:4] Event 0 enable.

0: Channel 2 does not control event 0.
1: Channel 2 controls event 0.

 When 0 &lt; CCACT &lt; 8, EV0_GEN becomes zero after a capture or compare event.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>CCACT</name>
              <description>[3:0] Capture-Compare action.

Capture-Compare action defines 15 different channel functions that utilize capture, compare, and zero events.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PULSE_ON_CMP</name>
                  <value>15</value>
                  <description>Pulse on compare repeatedly.

Channel function sequence:
- Pulse enabled events when CH2CC.VALUE = CNTR.VALUE.

 The event is high for two timer clock periods.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TGL_ON_CMP</name>
                  <value>14</value>
                  <description>Toggle on compare repeatedly.

Channel function sequence:
- Toggle enabled events  when CH2CC.VALUE = CNTR.VALUE.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_ON_CMP</name>
                  <value>13</value>
                  <description>Set on compare repeatedly.

Channel function sequence:
- Set enabled events  when CH2CC.VALUE = CNTR.VALUE.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR_ON_CMP</name>
                  <value>12</value>
                  <description>Clear on compare repeatedly.

Channel function sequence:
- Clear enabled events  when CH2CC.VALUE = CNTR.VALUE.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_ON_0_TGL_ON_CMP</name>
                  <value>11</value>
                  <description>Set on zero, toggle on compare repeatedly.

