seanmlyons22/ti-lprf-pacs/svds/cc13x2x7_cc26x2x7.svd
        <register>
          <name>NVIC_ICPR0</name>
          <addressOffset>0x280</addressOffset>
          <size>32</size>
          <description>Irq 0 to 31 Clear Pending
This register is used to clear pending interrupts and determine which interrupts are currently pending.</description>
          <fields>
            <field>
              <name>CLRPEND31</name>
              <description>[31:31] Writing 0 to this bit has no effect, writing 1 to this bit clears the corresponding pending interrupt 31 (See EVENT:CPUIRQSEL31.EV for details). Reading the bit returns its current state.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>31</bitOffset>
            </field>
            <field>
              <name>CLRPEND30</name>
              <description>[30:30] Writing 0 to this bit has no effect, writing 1 to this bit clears the corresponding pending interrupt 30 (See EVENT:CPUIRQSEL30.EV for details). Reading the bit returns its current state.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>30</bitOffset>
            </field>
            <field>
              <name>CLRPEND29</name>
              <description>[29:29] Writing 0 to this bit has no effect, writing 1 to this bit clears the corresponding pending interrupt 29 (See EVENT:CPUIRQSEL29.EV for details). Reading the bit returns its current state.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>29</bitOffset>
            </field>
            <field>
              <name>CLRPEND28</name>
              <description>[28:28] Writing 0 to this bit has no effect, writing 1 to this bit clears the corresponding pending interrupt 28 (See EVENT:CPUIRQSEL28.EV for details). Reading the bit returns its current state.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>28</bitOffset>
            </field>
            <field>
              <name>CLRPEND27</name>
              <description>[27:27] Writing 0 to this bit has no effect, writing 1 to this bit clears the corresponding pending interrupt 27 (See EVENT:CPUIRQSEL27.EV for details). Reading the bit returns its current state.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>27</bitOffset>
            </field>
            <field>
              <name>CLRPEND26</name>
              <description>[26:26] Writing 0 to this bit has no effect, writing 1 to this bit clears the corresponding pending interrupt 26 (See EVENT:CPUIRQSEL26.EV for details). Reading the bit returns its current state.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>26</bitOffset>
            </field>
            <field>
              <name>CLRPEND25</name>
              <description>[25:25] Writing 0 to this bit has no effect, writing 1 to this bit clears the corresponding pending interrupt 25 (See EVENT:CPUIRQSEL25.EV for details). Reading the bit returns its current state.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>25</bitOffset>
            </field>
            <field>
              <name>CLRPEND24</name>
              <description>[24:24] Writing 0 to this bit has no effect, writing 1 to this bit clears the corresponding pending interrupt 24 (See EVENT:CPUIRQSEL24.EV for details). Reading the bit returns its current state.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>CLRPEND23</name>
              <description>[23:23] Writing 0 to this bit has no effect, writing 1 to this bit clears the corresponding pending interrupt 23 (See EVENT:CPUIRQSEL23.EV for details). Reading the bit returns its current state.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>23</bitOffset>
            </field>
            <field>
              <name>CLRPEND22</name>
              <description>[22:22] Writing 0 to this bit has no effect, writing 1 to this bit clears the corresponding pending interrupt 22 (See EVENT:CPUIRQSEL22.EV for details). Reading the bit returns its current state.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>22</bitOffset>
            </field>
            <field>
              <name>CLRPEND21</name>
              <description>[21:21] Writing 0 to this bit has no effect, writing 1 to this bit clears the corresponding pending interrupt 21 (See EVENT:CPUIRQSEL21.EV for details). Reading the bit returns its current state.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>21</bitOffset>
            </field>
            <field>
              <name>CLRPEND20</name>
              <description>[20:20] Writing 0 to this bit has no effect, writing 1 to this bit clears the corresponding pending interrupt 20 (See EVENT:CPUIRQSEL20.EV for details). Reading the bit returns its current state.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>20</bitOffset>
            </field>
            <field>
              <name>CLRPEND19</name>
              <description>[19:19] Writing 0 to this bit has no effect, writing 1 to this bit clears the corresponding pending interrupt 19 (See EVENT:CPUIRQSEL19.EV for details). Reading the bit returns its current state.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>19</bitOffset>
            </field>
            <field>
              <name>CLRPEND18</name>
              <description>[18:18] Writing 0 to this bit has no effect, writing 1 to this bit clears the corresponding pending interrupt 18 (See EVENT:CPUIRQSEL18.EV for details). Reading the bit returns its current state.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>18</bitOffset>
            </field>
            <field>
              <name>CLRPEND17</name>
              <description>[17:17] Writing 0 to this bit has no effect, writing 1 to this bit clears the corresponding pending interrupt 17 (See EVENT:CPUIRQSEL17.EV for details). Reading the bit returns its current state.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>17</bitOffset>
            </field>
            <field>
              <name>CLRPEND16</name>
              <description>[16:16] Writing 0 to this bit has no effect, writing 1 to this bit clears the corresponding pending interrupt 16 (See EVENT:CPUIRQSEL16.EV for details). Reading the bit returns its current state.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>CLRPEND15</name>
              <description>[15:15] Writing 0 to this bit has no effect, writing 1 to this bit clears the corresponding pending interrupt 15 (See EVENT:CPUIRQSEL15.EV for details). Reading the bit returns its current state.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
            <field>
              <name>CLRPEND14</name>
              <description>[14:14] Writing 0 to this bit has no effect, writing 1 to this bit clears the corresponding pending interrupt 14 (See EVENT:CPUIRQSEL14.EV for details). Reading the bit returns its current state.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>CLRPEND13</name>
              <description>[13:13] Writing 0 to this bit has no effect, writing 1 to this bit clears the corresponding pending interrupt 13 (See EVENT:CPUIRQSEL13.EV for details). Reading the bit returns its current state.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>CLRPEND12</name>
              <description>[12:12] Writing 0 to this bit has no effect, writing 1 to this bit clears the corresponding pending interrupt 12 (See EVENT:CPUIRQSEL12.EV for details). Reading the bit returns its current state.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>CLRPEND11</name>
              <description>[11:11] Writing 0 to this bit has no effect, writing 1 to this bit clears the corresponding pending interrupt 11 (See EVENT:CPUIRQSEL11.EV for details). Reading the bit returns its current state.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>CLRPEND10</name>
              <description>[10:10] Writing 0 to this bit has no effect, writing 1 to this bit clears the corresponding pending interrupt 10 (See EVENT:CPUIRQSEL10.EV for details). Reading the bit returns its current state.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>CLRPEND9</name>
              <description>[9:9] Writing 0 to this bit has no effect, writing 1 to this bit clears the corresponding pending interrupt 9 (See EVENT:CPUIRQSEL9.EV for details). Reading the bit returns its current state.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>CLRPEND8</name>
              <description>[8:8] Writing 0 to this bit has no effect, writing 1 to this bit clears the corresponding pending interrupt 8 (See EVENT:CPUIRQSEL8.EV for details). Reading the bit returns its current state.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>CLRPEND7</name>
              <description>[7:7] Writing 0 to this bit has no effect, writing 1 to this bit clears the corresponding pending interrupt 7 (See EVENT:CPUIRQSEL7.EV for details). Reading the bit returns its current state.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>CLRPEND6</name>
              <description>[6:6] Writing 0 to this bit has no effect, writing 1 to this bit clears the corresponding pending interrupt 6 (See EVENT:CPUIRQSEL6.EV for details). Reading the bit returns its current state.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>CLRPEND5</name>
              <description>[5:5] Writing 0 to this bit has no effect, writing 1 to this bit clears the corresponding pending interrupt 5 (See EVENT:CPUIRQSEL5.EV for details). Reading the bit returns its current state.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>CLRPEND4</name>
              <description>[4:4] Writing 0 to this bit has no effect, writing 1 to this bit clears the corresponding pending interrupt 4 (See EVENT:CPUIRQSEL4.EV for details). Reading the bit returns its current state.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>CLRPEND3</name>
              <description>[3:3] Writing 0 to this bit has no effect, writing 1 to this bit clears the corresponding pending interrupt 3 (See EVENT:CPUIRQSEL3.EV for details). Reading the bit returns its current state.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>CLRPEND2</name>
              <description>[2:2] Writing 0 to this bit has no effect, writing 1 to this bit clears the corresponding pending interrupt 2 (See EVENT:CPUIRQSEL2.EV for details). Reading the bit returns its current state.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>CLRPEND1</name>
              <description>[1:1] Writing 0 to this bit has no effect, writing 1 to this bit clears the corresponding pending interrupt 1 (See EVENT:CPUIRQSEL1.EV for details). Reading the bit returns its current state.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>CLRPEND0</name>
              <description>[0:0] Writing 0 to this bit has no effect, writing 1 to this bit clears the corresponding pending interrupt 0 (See EVENT:CPUIRQSEL0.EV for details). Reading the bit returns its current state.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>NVIC_ICPR1</name>
          <addressOffset>0x284</addressOffset>
          <size>32</size>
          <description>Irq 32 to 63 Clear Pending
This register is used to clear pending interrupts and determine which interrupts are currently pending.</description>
          <fields>
            <field>
              <name>RESERVED6</name>
              <description>[31:6] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>26</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>CLRPEND37</name>
              <description>[5:5] Writing 0 to this bit has no effect, writing 1 to this bit clears the corresponding pending interrupt 37 (See EVENT:CPUIRQSEL37.EV for details). Reading the bit returns its current state.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>CLRPEND36</name>
              <description>[4:4] Writing 0 to this bit has no effect, writing 1 to this bit clears the corresponding pending interrupt 36 (See EVENT:CPUIRQSEL36.EV for details). Reading the bit returns its current state.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>CLRPEND35</name>
              <description>[3:3] Writing 0 to this bit has no effect, writing 1 to this bit clears the corresponding pending interrupt 35 (See EVENT:CPUIRQSEL35.EV for details). Reading the bit returns its current state.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>CLRPEND34</name>
              <description>[2:2] Writing 0 to this bit has no effect, writing 1 to this bit clears the corresponding pending interrupt 34 (See EVENT:CPUIRQSEL34.EV for details). Reading the bit returns its current state.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>CLRPEND33</name>
              <description>[1:1] Writing 0 to this bit has no effect, writing 1 to this bit clears the corresponding pending interrupt 33 (See EVENT:CPUIRQSEL33.EV for details). Reading the bit returns its current state.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>CLRPEND32</name>
              <description>[0:0] Writing 0 to this bit has no effect, writing 1 to this bit clears the corresponding pending interrupt 32 (See EVENT:CPUIRQSEL32.EV for details). Reading the bit returns its current state.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
