seanmlyons22/ti-lprf-pacs/svds/cc13x2x7_cc26x2x7.svd
0: Continuous formatting disabled
1: Continuous formatting enabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>[0:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x102</resetValue>
        </register>
        <register>
          <name>FSCR</name>
          <addressOffset>0x308</addressOffset>
          <size>32</size>
          <description>Formatter Synchronization Counter</description>
          <fields>
            <field>
              <name>FSCR</name>
              <description>[31:0] The global synchronization trigger is generated by the Program Counter (PC) Sampler block. This means that there is no synchronization counter in the TPIU.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>CLAIMMASK</name>
          <addressOffset>0xfa0</addressOffset>
          <size>32</size>
          <description>Claim Tag Mask</description>
          <fields>
            <field>
              <name>CLAIMMASK</name>
              <description>[31:0] This register forms one half of the Claim Tag value. When reading this register returns the number of bits that can be set (each bit is considered separately):

0: This claim tag bit is not implemented
1: This claim tag bit is not implemented

The behavior when writing to this register is described in CLAIMSET.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xF</resetValue>
        </register>
        <register>
          <name>CLAIMSET</name>
          <addressOffset>0xfa0</addressOffset>
          <size>32</size>
          <description>Claim Tag Set</description>
          <fields>
            <field>
              <name>CLAIMSET</name>
              <description>[31:0] This register forms one half of the Claim Tag value. Writing to this location allows individual bits to be set (each bit is considered separately):

0: No effect
1: Set this bit in the claim tag

The behavior when reading from this location is described in CLAIMMASK.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xF</resetValue>
        </register>
        <register>
          <name>CLAIMTAG</name>
          <addressOffset>0xfa4</addressOffset>
          <size>32</size>
          <description>Current Claim Tag</description>
          <fields>
            <field>
              <name>CLAIMTAG</name>
              <description>[31:0] This register forms one half of the Claim Tag value. Reading this register returns the current Claim Tag value.
Reading CLAIMMASK determines how many bits from this register must be used.

The behavior when writing to this register is described in CLAIMCLR.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>CLAIMCLR</name>
          <addressOffset>0xfa4</addressOffset>
          <size>32</size>
          <description>Claim Tag Clear</description>
          <fields>
            <field>
              <name>CLAIMCLR</name>
              <description>[31:0] This register forms one half of the Claim Tag value. Writing to this location enables individual bits to be cleared (each bit is considered separately):

0: No effect
1: Clear this bit in the claim tag.

The behavior when reading from this location is described in CLAIMTAG.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>DEVID</name>
          <addressOffset>0xfc8</addressOffset>
          <size>32</size>
          <description>Device ID</description>
          <fields>
            <field>
              <name>DEVID</name>
              <description>[31:0] This field returns: 0xCA1 if there is an ETM present. 0xCA0 if there is no ETM present.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xCA0</resetValue>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>CRYPTO</name>
      <baseAddress>0x40024000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x800</size>
        <usage>registers</usage>
      </addressBlock>
      <description>DMA Crypto Core is a low power low gate count crypto core with DMA capability and local key storage.</description>
      <registers>
        <register>
          <name>DMACH0CTL</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>Channel 0 Control
This register is used for channel enabling and priority selection. When a channel is disabled, it becomes inactive only when all ongoing requests are finished.</description>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>PRIO</name>
              <description>[1:1] Channel priority
0: Low
1: High
If both channels have the same priority, access of the channels to the external port is arbitrated using the round robin scheme. If one channel has a high priority and another one low, the channel with the high priority is served first, in case of simultaneous access requests.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>EN</name>
              <description>[0:0] Channel enable
0: Disabled
1: Enable
Note: Disabling an active channel interrupts the DMA operation. The ongoing block transfer completes, but no new transfers are requested.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>DMACH0EXTADDR</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>Channel 0 External Address</description>
          <fields>
            <field>
              <name>ADDR</name>
              <description>[31:0] Channel external address value
When read during operation, it holds the last updated external address after being sent to the master interface.  Note: The crypto DMA copies out upto 3 bytes until it hits a word boundary, thus the address need not be word aligned.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>DMACH0LEN</name>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <description>Channel 0 DMA Length</description>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>DMALEN</name>
              <description>[15:0] Channel DMA length in bytes
During configuration, this register contains the DMA transfer length in bytes. During operation, it contains the last updated value of the DMA transfer length after being sent to the master interface.
Note: Setting this register to a nonzero value starts the transfer if the channel is enabled. Therefore, this register must be written last when setting up a DMA channel.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>DMASTAT</name>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <description>DMAC Status
This register provides the actual state of each DMA channel. It also reports port errors in case these were received by the master interface module during the data transfer.</description>
          <fields>
            <field>
              <name>RESERVED18</name>
              <description>[31:18] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>14</bitWidth>
              <bitOffset>18</bitOffset>
            </field>
            <field>
              <name>PORT_ERR</name>
              <description>[17:17] Reflects possible transfer errors on the AHB port.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>17</bitOffset>
            </field>
            <field>
              <name>RESERVED2</name>
              <description>[16:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>15</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>CH1_ACT</name>
              <description>[1:1] A value of 1 indicates that channel 1 is active (DMA transfer on-going).</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>CH0_ACT</name>
              <description>[0:0] A value of 1 indicates that channel 0 is active (DMA transfer on-going).</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>DMASWRESET</name>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <description>DMAC Software Reset
Software reset is used to reset the DMAC to stop all transfers and clears the port error status register. After the software reset is performed, all the channels are disabled and no new requests are performed by the channels. The DMAC waits for the existing (active) requests to finish and accordingly sets the DMASTAT.</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>SWRES</name>
              <description>[0:0] Software reset enable
0 : Disabled
1 :  Enabled (self-cleared to 0)
Completion of the software reset must be checked through the DMASTAT</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>DMACH1CTL</name>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <description>Channel 1 Control
This register is used for channel enabling and priority selection. When a channel is disabled, it becomes inactive only when all ongoing requests are finished.</description>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>PRIO</name>
              <description>[1:1] Channel priority
0: Low
1: High
If both channels have the same priority, access of the channels to the external port is arbitrated using the round robin scheme. If one channel has a high priority and another one low, the channel with the high priority is served first, in case of simultaneous access requests.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>EN</name>
              <description>[0:0] Channel enable
0: Disabled
1: Enable
Note: Disabling an active channel interrupts the DMA operation. The ongoing block transfer completes, but no new transfers are requested.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>DMACH1EXTADDR</name>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <description>Channel 1 External Address</description>
          <fields>
            <field>
              <name>ADDR</name>
              <description>[31:0] Channel external address value.
When read during operation, it holds the last updated external address after being sent to the master interface.   Note: The crypto DMA copies out upto 3 bytes until it hits a word boundary, thus the address need not be word aligned.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>DMACH1LEN</name>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <description>Channel 1 DMA Length</description>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>DMALEN</name>
              <description>[15:0] Channel DMA length in bytes.
During configuration, this register contains the DMA transfer length in bytes. During operation, it contains the last updated value of the DMA transfer length after being sent to the master interface.
Note: Setting this register to a nonzero value starts the transfer if the channel is enabled. Therefore, this register must be written last when setting up a DMA channel.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>DMABUSCFG</name>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <description>DMAC Master Run-time Parameters
This register defines all the run-time parameters for the AHB master interface port. These parameters are required for the proper functioning of the EIP-101m AHB master adapter.</description>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>AHB_MST1_BURST_SIZE</name>
              <description>[15:12] Maximum burst size that can be performed on the AHB bus</description>
              <bitWidth>4</bitWidth>
              <bitOffset>12</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>64_BYTE</name>
                  <value>6</value>
                  <description>64 bytes</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32_BYTE</name>
                  <value>5</value>
                  <description>32 bytes</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16_BYTE</name>
                  <value>4</value>
                  <description>16 bytes</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8_BYTE</name>
                  <value>3</value>
                  <description>8 bytes</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4_BYTE</name>
                  <value>2</value>
                  <description>4 bytes</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AHB_MST1_IDLE_EN</name>
              <description>[11:11] Idle insertion between consecutive burst transfers on AHB</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IDLE</name>
                  <value>1</value>
                  <description>Idle transfer insertion enabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_IDLE</name>
                  <value>0</value>
                  <description>Do not insert idle transfers.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AHB_MST1_INCR_EN</name>
              <description>[10:10] Burst length type of AHB transfer</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SPECIFIED</name>
                  <value>1</value>
                  <description>Fixed length bursts or single transfers</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNSPECIFIED</name>
                  <value>0</value>
                  <description>Unspecified length burst transfers</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AHB_MST1_LOCK_EN</name>
              <description>[9:9] Locked transform on AHB</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOCKED</name>
                  <value>1</value>
                  <description>Transfers are locked</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_LOCKED</name>
                  <value>0</value>
                  <description>Transfers are not locked</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AHB_MST1_BIGEND</name>
              <description>[8:8] Endianess for the AHB master</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BIG_ENDIAN</name>
                  <value>1</value>
                  <description>Big Endian</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LITTLE_ENDIAN</name>
                  <value>0</value>
                  <description>Little Endian</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>[7:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x2400</resetValue>
        </register>
        <register>
          <name>DMAPORTERR</name>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <description>DMAC Port Error Raw Status
This register provides the actual status of individual port errors. It also indicates which channel is serviced by an external AHB port (which is frozen by a port error). A port error aborts operations on all serviced channels (channel enable bit is forced to 0) and prevents further transfers via that port until the error is cleared by writing to the DMASWRESET register.</description>
          <fields>
            <field>
              <name>RESERVED13</name>
              <description>[31:13] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>19</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>PORT1_AHB_ERROR</name>
              <description>[12:12] A value of 1 indicates that the EIP-101 has detected an AHB bus error</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>RESERVED10</name>
              <description>[11:10] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>PORT1_CHANNEL</name>
              <description>[9:9] Indicates which channel has serviced last (channel 0 or channel 1) by AHB master port.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>[8:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>9</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
