seanmlyons22/ti-lprf-pacs/svds/cc13x2x7_cc26x2x7.svd
        <register>
          <name>DMAHWVER</name>
          <addressOffset>0xfc</addressOffset>
          <size>32</size>
          <description>DMAC Version
This register contains an indication (or signature) of the EIP type of this DMAC, as well as the hardware version/patch numbers.</description>
          <fields>
            <field>
              <name>RESERVED28</name>
              <description>[31:28] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>28</bitOffset>
            </field>
            <field>
              <name>HW_MAJOR_VERSION</name>
              <description>[27:24] Major version number</description>
              <bitWidth>4</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>HW_MINOR_VERSION</name>
              <description>[23:20] Minor version number</description>
              <bitWidth>4</bitWidth>
              <bitOffset>20</bitOffset>
            </field>
            <field>
              <name>HW_PATCH_LEVEL</name>
              <description>[19:16] Patch level
Starts at 0 at first delivery of this version</description>
              <bitWidth>4</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>EIP_NUMBER_COMPL</name>
              <description>[15:8] Bit-by-bit complement of the EIP_NUMBER field bits.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>EIP_NUMBER</name>
              <description>[7:0] Binary encoding of the EIP-number of this DMA controller (209)</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1012ED1</resetValue>
        </register>
        <register>
          <name>KEYWRITEAREA</name>
          <addressOffset>0x400</addressOffset>
          <size>32</size>
          <description>Key Store Write Area
This register defines where the keys should be written in the key store RAM. After writing this register, the key store module is ready to receive the keys through a DMA operation. In case the key data transfer triggered an error in the key store, the error will be available in the interrupt status register after the DMA is finished. The key store write-error is asserted when the programmed/selected area is not completely written. This error is also asserted when the DMA operation writes to ram areas that are not selected.
The key store RAM is divided into 8 areas of 128 bits.
192-bit keys written in the key store RAM should start on boundaries of 256 bits. This means that writing a 192-bit key to the key store RAM must be done by writing 256 bits of data with the 64 most-significant bits set to 0. These bits are ignored by the AES engine.</description>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>RAM_AREA7</name>
              <description>[7:7] Each RAM_AREAx represents an area of 128 bits.
Select the key store RAM area(s) where the key(s) needs to be written
0: RAM_AREA7 is not selected to be written.
1: RAM_AREA7 is selected to be written.
Writing to multiple RAM locations is possible only when the selected RAM areas are sequential.
Keys that require more than one RAM locations (key size is 192 or 256 bits), must start at one of the following areas: RAM_AREA0, RAM_AREA2, RAM_AREA4, or RAM_AREA6.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEL</name>
                  <value>1</value>
                  <description>This RAM area is selected to be written</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_SEL</name>
                  <value>0</value>
                  <description>This RAM area is not selected to be written</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RAM_AREA6</name>
              <description>[6:6] Each RAM_AREAx represents an area of 128 bits.
Select the key store RAM area(s) where the key(s) needs to be written
0: RAM_AREA6 is not selected to be written.
1: RAM_AREA6 is selected to be written.
Writing to multiple RAM locations is possible only when the selected RAM areas are sequential.
Keys that require more than one RAM locations (key size is 192 or 256 bits), must start at one of the following areas: RAM_AREA0, RAM_AREA2, RAM_AREA4, or RAM_AREA6.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEL</name>
                  <value>1</value>
                  <description>This RAM area is selected to be written</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_SEL</name>
                  <value>0</value>
                  <description>This RAM area is not selected to be written</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RAM_AREA5</name>
              <description>[5:5] Each RAM_AREAx represents an area of 128 bits.
Select the key store RAM area(s) where the key(s) needs to be written
0: RAM_AREA5 is not selected to be written.
1: RAM_AREA5 is selected to be written.
Writing to multiple RAM locations is possible only when the selected RAM areas are sequential.
Keys that require more than one RAM locations (key size is 192 or 256 bits), must start at one of the following areas: RAM_AREA0, RAM_AREA2, RAM_AREA4, or RAM_AREA6.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEL</name>
                  <value>1</value>
                  <description>This RAM area is selected to be written</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_SEL</name>
                  <value>0</value>
                  <description>This RAM area is not selected to be written</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RAM_AREA4</name>
              <description>[4:4] Each RAM_AREAx represents an area of 128 bits.
Select the key store RAM area(s) where the key(s) needs to be written
0: RAM_AREA4 is not selected to be written.
1: RAM_AREA4 is selected to be written.
Writing to multiple RAM locations is possible only when the selected RAM areas are sequential.
Keys that require more than one RAM locations (key size is 192 or 256 bits), must start at one of the following areas: RAM_AREA0, RAM_AREA2, RAM_AREA4, or RAM_AREA6.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEL</name>
                  <value>1</value>
                  <description>This RAM area is selected to be written</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_SEL</name>
                  <value>0</value>
                  <description>This RAM area is not selected to be written</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RAM_AREA3</name>
              <description>[3:3] Each RAM_AREAx represents an area of 128 bits.
Select the key store RAM area(s) where the key(s) needs to be written
0: RAM_AREA3 is not selected to be written.
1: RAM_AREA3 is selected to be written.
Writing to multiple RAM locations is possible only when the selected RAM areas are sequential.
Keys that require more than one RAM locations (key size is 192 or 256 bits), must start at one of the following areas: RAM_AREA0, RAM_AREA2, RAM_AREA4, or RAM_AREA6.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEL</name>
                  <value>1</value>
                  <description>This RAM area is selected to be written</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_SEL</name>
                  <value>0</value>
                  <description>This RAM area is not selected to be written</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RAM_AREA2</name>
              <description>[2:2] Each RAM_AREAx represents an area of 128 bits.
Select the key store RAM area(s) where the key(s) needs to be written
0: RAM_AREA2 is not selected to be written.
1: RAM_AREA2 is selected to be written.
Writing to multiple RAM locations is possible only when the selected RAM areas are sequential.
Keys that require more than one RAM locations (key size is 192 or 256 bits), must start at one of the following areas: RAM_AREA0, RAM_AREA2, RAM_AREA4, or RAM_AREA6.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEL</name>
                  <value>1</value>
                  <description>This RAM area is selected to be written</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_SEL</name>
                  <value>0</value>
                  <description>This RAM area is not selected to be written</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RAM_AREA1</name>
              <description>[1:1] Each RAM_AREAx represents an area of 128 bits.
Select the key store RAM area(s) where the key(s) needs to be written
0: RAM_AREA1 is not selected to be written.
1: RAM_AREA1 is selected to be written.
Writing to multiple RAM locations is possible only when the selected RAM areas are sequential.
Keys that require more than one RAM locations (key size is 192 or 256 bits), must start at one of the following areas: RAM_AREA0, RAM_AREA2, RAM_AREA4, or RAM_AREA6.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEL</name>
                  <value>1</value>
                  <description>This RAM area is selected to be written</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_SEL</name>
                  <value>0</value>
                  <description>This RAM area is not selected to be written</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RAM_AREA0</name>
              <description>[0:0] Each RAM_AREAx represents an area of 128 bits.
Select the key store RAM area(s) where the key(s) needs to be written
0: RAM_AREA0 is not selected to be written.
1: RAM_AREA0 is selected to be written.
Writing to multiple RAM locations is possible only when the selected RAM areas are sequential.
Keys that require more than one RAM locations (key size is 192 or 256 bits), must start at one of the following areas: RAM_AREA0, RAM_AREA2, RAM_AREA4, or RAM_AREA6.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEL</name>
                  <value>1</value>
                  <description>This RAM area is selected to be written</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_SEL</name>
                  <value>0</value>
                  <description>This RAM area is not selected to be written</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>KEYWRITTENAREA</name>
          <addressOffset>0x404</addressOffset>
          <size>32</size>
          <description>Key Store Written Area
This register shows which areas of the key store RAM contain valid written keys.
When a new key needs to be written to the key store, on a location that is already occupied by a valid key, this key area must be cleared first. This can be done by writing this register before the new key is written to the key store memory.
Attempting to write to a key area that already contains a valid key is not allowed and results in an error.</description>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>RAM_AREA_WRITTEN7</name>
              <description>[7:7] On read this bit returns the key area written status.

This bit can be reset by writing a 1.

Note: This register will be reset on a soft reset initiated by writing to DMASWRESET.SWRES. After a soft reset, all keys must be rewritten to the key store memory.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WRITTEN</name>
                  <value>1</value>
                  <description>This RAM area is written with valid key information</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_WRITTEN</name>
                  <value>0</value>
                  <description>This RAM area is not written with valid key information</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RAM_AREA_WRITTEN6</name>
              <description>[6:6] On read this bit returns the key area written status.

This bit can be reset by writing a 1.

Note: This register will be reset on a soft reset initiated by writing to DMASWRESET.SWRES. After a soft reset, all keys must be rewritten to the key store memory.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WRITTEN</name>
                  <value>1</value>
                  <description>This RAM area is written with valid key information</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_WRITTEN</name>
                  <value>0</value>
                  <description>This RAM area is not written with valid key information</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RAM_AREA_WRITTEN5</name>
              <description>[5:5] On read this bit returns the key area written status.

This bit can be reset by writing a 1.

Note: This register will be reset on a soft reset initiated by writing to DMASWRESET.SWRES. After a soft reset, all keys must be rewritten to the key store memory.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WRITTEN</name>
                  <value>1</value>
                  <description>This RAM area is written with valid key information</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_WRITTEN</name>
                  <value>0</value>
                  <description>This RAM area is not written with valid key information</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RAM_AREA_WRITTEN4</name>
              <description>[4:4] On read this bit returns the key area written status.

This bit can be reset by writing a 1.

Note: This register will be reset on a soft reset initiated by writing to DMASWRESET.SWRES. After a soft reset, all keys must be rewritten to the key store memory.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WRITTEN</name>
                  <value>1</value>
                  <description>This RAM area is written with valid key information</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_WRITTEN</name>
                  <value>0</value>
                  <description>This RAM area is not written with valid key information</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RAM_AREA_WRITTEN3</name>
              <description>[3:3] On read this bit returns the key area written status.

This bit can be reset by writing a 1.

Note: This register will be reset on a soft reset initiated by writing to DMASWRESET.SWRES. After a soft reset, all keys must be rewritten to the key store memory.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WRITTEN</name>
                  <value>1</value>
                  <description>This RAM area is written with valid key information</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_WRITTEN</name>
                  <value>0</value>
                  <description>This RAM area is not written with valid key information</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RAM_AREA_WRITTEN2</name>
              <description>[2:2] On read this bit returns the key area written status.

This bit can be reset by writing a 1.

Note: This register will be reset on a soft reset initiated by writing to DMASWRESET.SWRES. After a soft reset, all keys must be rewritten to the key store memory.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WRITTEN</name>
                  <value>1</value>
                  <description>This RAM area is written with valid key information</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_WRITTEN</name>
                  <value>0</value>
                  <description>This RAM area is not written with valid key information</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RAM_AREA_WRITTEN1</name>
              <description>[1:1] On read this bit returns the key area written status.

This bit can be reset by writing a 1.

Note: This register will be reset on a soft reset initiated by writing to DMASWRESET.SWRES. After a soft reset, all keys must be rewritten to the key store memory.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WRITTEN</name>
                  <value>1</value>
                  <description>This RAM area is written with valid key information</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_WRITTEN</name>
                  <value>0</value>
                  <description>This RAM area is not written with valid key information</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RAM_AREA_WRITTEN0</name>
              <description>[0:0] On read this bit returns the key area written status.

This bit can be reset by writing a 1.

Note: This register will be reset on a soft reset initiated by writing to DMASWRESET.SWRES. After a soft reset, all keys must be rewritten to the key store memory.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>KEYSIZE</name>
          <addressOffset>0x408</addressOffset>
          <size>32</size>
          <description>Key Store Size
This register defines the size of the keys that are written with DMA. This register should be configured before writing to the KEY_STORE_WRITE_AREA register.</description>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>SIZE</name>
              <description>[1:0] Key size:
00: Reserved
When writing this to this register, the KEY_STORE_WRITTEN_AREA register is reset.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>256_BIT</name>
                  <value>3</value>
                  <description>256 bits</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>192_BIT</name>
                  <value>2</value>
                  <description>192 bits</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>128_BIT</name>
                  <value>1</value>
                  <description>128 bits</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
