seanmlyons22/ti-lprf-pacs/svds/cc13x2x7_cc26x2x7.svd
                <enumeratedValue>
                  <name>GPT0A</name>
                  <value>16</value>
                  <description>GPT0A interrupt event, controlled by GPT0:TAMR</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT3B</name>
                  <value>15</value>
                  <description>GPT3B interrupt event, controlled by GPT3:TBMR</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT3A</name>
                  <value>14</value>
                  <description>GPT3A interrupt event, controlled by GPT3:TAMR</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT2B</name>
                  <value>13</value>
                  <description>GPT2B interrupt event, controlled by GPT2:TBMR</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT2A</name>
                  <value>12</value>
                  <description>GPT2A interrupt event, controlled by GPT2:TAMR</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_COMB</name>
                  <value>11</value>
                  <description>AUX combined event, the corresponding flag register is here AUX_EVCTL:EVTOMCUFLAGS</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AON_AUX_SWEV0</name>
                  <value>10</value>
                  <description>AUX Software event 0, AUX_EVCTL:SWEVSET.SWEV0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C_IRQ</name>
                  <value>9</value>
                  <description>Interrupt event from I2C</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2S_IRQ</name>
                  <value>8</value>
                  <description>Interrupt event from I2S</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AON_RTC_COMB</name>
                  <value>7</value>
                  <description>Event from AON_RTC, controlled by the AON_RTC:CTL.COMB_EV_MASK setting</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSC_COMB</name>
                  <value>6</value>
                  <description>Combined event from Oscillator control</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BATMON_COMB</name>
                  <value>5</value>
                  <description>Combined event from battery monitor</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AON_GPIO_EDGE</name>
                  <value>4</value>
                  <description>Edge detect event from IOC. Configureded by the IOC:IOCFGn.EDGE_IRQ_EN and  IOC:IOCFGn.EDGE_DET settings</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AON_PROG2</name>
                  <value>3</value>
                  <description>AON programmable event 2. Event selected by AON_EVENT MCU event selector, AON_EVENT:EVTOMCUSEL.AON_PROG2_EV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AON_PROG1</name>
                  <value>2</value>
                  <description>AON programmable event 1. Event selected by AON_EVENT MCU event selector, AON_EVENT:EVTOMCUSEL.AON_PROG1_EV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AON_PROG0</name>
                  <value>1</value>
                  <description>AON programmable event 0. Event selected by AON_EVENT  MCU event selector, AON_EVENT:EVTOMCUSEL.AON_PROG0_EV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0</value>
                  <description>Always inactive</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>UDMACH15SSEL</name>
          <addressOffset>0x578</addressOffset>
          <size>32</size>
          <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
          <fields>
            <field>
              <name>EV</name>
              <description>[31:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AON_RTC_COMB</name>
                  <value>7</value>
                  <description>Event from AON_RTC, controlled by the AON_RTC:CTL.COMB_EV_MASK setting</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x7</resetValue>
        </register>
        <register>
          <name>UDMACH15BSEL</name>
          <addressOffset>0x57c</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 15 REQ</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>EV</name>
              <description>[6:0] Read only selection value</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AON_RTC_COMB</name>
                  <value>7</value>
                  <description>Event from AON_RTC, controlled by the AON_RTC:CTL.COMB_EV_MASK setting</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x7</resetValue>
        </register>
        <register>
          <name>UDMACH16SSEL</name>
          <addressOffset>0x580</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 16 SREQ</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>EV</name>
              <description>[6:0] Read only selection value</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SSI1_RX_DMASREQ</name>
                  <value>45</value>
                  <description>SSI1 RX DMA single request, controlled by SSI0:DMACR.RXDMAE</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x2D</resetValue>
        </register>
        <register>
          <name>UDMACH16BSEL</name>
          <addressOffset>0x584</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 16 REQ</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>EV</name>
              <description>[6:0] Read only selection value</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SSI1_RX_DMABREQ</name>
                  <value>44</value>
                  <description>SSI1 RX DMA burst request , controlled by SSI0:DMACR.RXDMAE</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x2C</resetValue>
        </register>
        <register>
          <name>UDMACH17SSEL</name>
          <addressOffset>0x588</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 17 SREQ</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>EV</name>
              <description>[6:0] Read only selection value</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SSI1_TX_DMASREQ</name>
                  <value>47</value>
                  <description>SSI1 TX DMA single request, controlled by SSI0:DMACR.TXDMAE</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x2F</resetValue>
        </register>
        <register>
          <name>UDMACH17BSEL</name>
          <addressOffset>0x58c</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 17 REQ</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>EV</name>
              <description>[6:0] Read only selection value</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SSI1_TX_DMABREQ</name>
                  <value>46</value>
                  <description>SSI1 TX DMA burst request , controlled by SSI0:DMACR.TXDMAE</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x2E</resetValue>
        </register>
        <register>
          <name>UDMACH18SSEL</name>
          <addressOffset>0x590</addressOffset>
          <size>32</size>
          <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
          <fields>
            <field>
              <name>EV</name>
              <description>[31:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0</value>
                  <description>Always inactive</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>UDMACH18BSEL</name>
          <addressOffset>0x594</addressOffset>
          <size>32</size>
          <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
          <fields>
            <field>
              <name>EV</name>
              <description>[31:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0</value>
                  <description>Always inactive</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>UDMACH19SSEL</name>
          <addressOffset>0x598</addressOffset>
          <size>32</size>
          <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
          <fields>
            <field>
              <name>EV</name>
              <description>[31:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0</value>
                  <description>Always inactive</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>UDMACH19BSEL</name>
          <addressOffset>0x59c</addressOffset>
          <size>32</size>
          <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
          <fields>
            <field>
              <name>EV</name>
              <description>[31:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0</value>
                  <description>Always inactive</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>UDMACH20SSEL</name>
          <addressOffset>0x5a0</addressOffset>
          <size>32</size>
          <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
          <fields>
            <field>
              <name>EV</name>
              <description>[31:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0</value>
                  <description>Always inactive</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>UDMACH20BSEL</name>
          <addressOffset>0x5a4</addressOffset>
          <size>32</size>
          <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
          <fields>
            <field>
              <name>EV</name>
              <description>[31:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0</value>
                  <description>Always inactive</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>UDMACH21SSEL</name>
          <addressOffset>0x5a8</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 21 SREQ</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>EV</name>
              <description>[6:0] Read only selection value</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SWEV0</name>
                  <value>100</value>
                  <description>Software event 0, triggered by SWEV.SWEV0</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x64</resetValue>
        </register>
        <register>
          <name>UDMACH21BSEL</name>
          <addressOffset>0x5ac</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 21 REQ</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>EV</name>
              <description>[6:0] Read only selection value</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SWEV0</name>
                  <value>100</value>
                  <description>Software event 0, triggered by SWEV.SWEV0</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x64</resetValue>
        </register>
        <register>
          <name>UDMACH22SSEL</name>
          <addressOffset>0x5b0</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 22 SREQ</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>EV</name>
              <description>[6:0] Read only selection value</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SWEV1</name>
                  <value>101</value>
                  <description>Software event 1, triggered by SWEV.SWEV1</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x65</resetValue>
        </register>
        <register>
          <name>UDMACH22BSEL</name>
          <addressOffset>0x5b4</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 22 REQ</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>EV</name>
              <description>[6:0] Read only selection value</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SWEV1</name>
                  <value>101</value>
                  <description>Software event 1, triggered by SWEV.SWEV1</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x65</resetValue>
        </register>
        <register>
          <name>UDMACH23SSEL</name>
          <addressOffset>0x5b8</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 23 SREQ</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>EV</name>
              <description>[6:0] Read only selection value</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SWEV2</name>
                  <value>102</value>
                  <description>Software event 2, triggered by SWEV.SWEV2</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x66</resetValue>
        </register>
