seanmlyons22/ti-lprf-pacs/svds/cc13x2x7_cc26x2x7.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>GPIO</name>
      <baseAddress>0x40022000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <description>MCU GPIO - I/F for controlling and reading IO status and IO event status</description>
      <registers>
        <register>
          <name>DOUT3_0</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>Data Out 0 to 3

Alias register for byte access to each bit in DOUT31_0</description>
          <fields>
            <field>
              <name>RESERVED25</name>
              <description>[31:25] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>25</bitOffset>
            </field>
            <field>
              <name>DIO3</name>
              <description>[24:24] Sets the state of the pin that is configured as DIO#3, if the corresponding DOE31_0 bitfield is set.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>RESERVED17</name>
              <description>[23:17] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>17</bitOffset>
            </field>
            <field>
              <name>DIO2</name>
              <description>[16:16] Sets the state of the pin that is configured as DIO#2, if the corresponding DOE31_0 bitfield is set.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>RESERVED9</name>
              <description>[15:9] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>DIO1</name>
              <description>[8:8] Sets the state of the pin that is configured as DIO#1, if the corresponding DOE31_0 bitfield is set.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>[7:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>DIO0</name>
              <description>[0:0] Sets the state of the pin that is configured as DIO#0, if the corresponding DOE31_0 bitfield is set.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>DOUT7_4</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>Data Out 4 to 7

Alias register for byte access to each bit in DOUT31_0</description>
          <fields>
            <field>
              <name>RESERVED25</name>
              <description>[31:25] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>25</bitOffset>
            </field>
            <field>
              <name>DIO7</name>
              <description>[24:24] Sets the state of the pin that is configured as DIO#7, if the corresponding DOE31_0 bitfield is set.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>RESERVED17</name>
              <description>[23:17] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>17</bitOffset>
            </field>
            <field>
              <name>DIO6</name>
              <description>[16:16] Sets the state of the pin that is configured as DIO#6, if the corresponding DOE31_0 bitfield is set.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>RESERVED9</name>
              <description>[15:9] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>DIO5</name>
              <description>[8:8] Sets the state of the pin that is configured as DIO#5, if the corresponding DOE31_0 bitfield is set.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>[7:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>DIO4</name>
              <description>[0:0] Sets the state of the pin that is configured as DIO#4, if the corresponding DOE31_0 bitfield is set.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>DOUT11_8</name>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <description>Data Out 8 to 11

Alias register for byte access to each bit in DOUT31_0</description>
          <fields>
            <field>
              <name>RESERVED25</name>
              <description>[31:25] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>25</bitOffset>
            </field>
            <field>
              <name>DIO11</name>
              <description>[24:24] Sets the state of the pin that is configured as DIO#11, if the corresponding DOE31_0 bitfield is set.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>RESERVED17</name>
              <description>[23:17] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>17</bitOffset>
            </field>
            <field>
              <name>DIO10</name>
              <description>[16:16] Sets the state of the pin that is configured as DIO#10, if the corresponding DOE31_0 bitfield is set.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>RESERVED9</name>
              <description>[15:9] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>DIO9</name>
              <description>[8:8] Sets the state of the pin that is configured as DIO#9, if the corresponding DOE31_0 bitfield is set.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>[7:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>DIO8</name>
              <description>[0:0] Sets the state of the pin that is configured as DIO#8, if the corresponding DOE31_0 bitfield is set.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>DOUT15_12</name>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <description>Data Out 12 to 15

Alias register for byte access to each bit in DOUT31_0</description>
          <fields>
            <field>
              <name>RESERVED25</name>
              <description>[31:25] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>25</bitOffset>
            </field>
            <field>
              <name>DIO15</name>
              <description>[24:24] Sets the state of the pin that is configured as DIO#15, if the corresponding DOE31_0 bitfield is set.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>RESERVED17</name>
              <description>[23:17] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>17</bitOffset>
            </field>
            <field>
              <name>DIO14</name>
              <description>[16:16] Sets the state of the pin that is configured as DIO#14, if the corresponding DOE31_0 bitfield is set.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>RESERVED9</name>
              <description>[15:9] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>DIO13</name>
              <description>[8:8] Sets the state of the pin that is configured as DIO#13, if the corresponding DOE31_0 bitfield is set.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>[7:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>DIO12</name>
              <description>[0:0] Sets the state of the pin that is configured as DIO#12, if the corresponding DOE31_0 bitfield is set.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>DOUT19_16</name>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <description>Data Out 16 to 19

Alias register for byte access to each bit in DOUT31_0</description>
          <fields>
            <field>
              <name>RESERVED25</name>
              <description>[31:25] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>25</bitOffset>
            </field>
            <field>
              <name>DIO19</name>
              <description>[24:24] Sets the state of the pin that is configured as DIO#19, if the corresponding DOE31_0 bitfield is set.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>RESERVED17</name>
              <description>[23:17] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>17</bitOffset>
            </field>
            <field>
              <name>DIO18</name>
              <description>[16:16] Sets the state of the pin that is configured as DIO#18, if the corresponding DOE31_0 bitfield is set.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>RESERVED9</name>
              <description>[15:9] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>DIO17</name>
              <description>[8:8] Sets the state of the pin that is configured as DIO#17, if the corresponding DOE31_0 bitfield is set.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>[7:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>DIO16</name>
              <description>[0:0] Sets the state of the pin that is configured as DIO#16, if the corresponding DOE31_0 bitfield is set.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>DOUT23_20</name>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <description>Data Out 20 to 23

Alias register for byte access to each bit in DOUT31_0</description>
          <fields>
            <field>
              <name>RESERVED25</name>
              <description>[31:25] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>25</bitOffset>
            </field>
            <field>
              <name>DIO23</name>
              <description>[24:24] Sets the state of the pin that is configured as DIO#23, if the corresponding DOE31_0 bitfield is set.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>RESERVED17</name>
              <description>[23:17] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>17</bitOffset>
            </field>
            <field>
              <name>DIO22</name>
              <description>[16:16] Sets the state of the pin that is configured as DIO#22, if the corresponding DOE31_0 bitfield is set.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>RESERVED9</name>
              <description>[15:9] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>DIO21</name>
              <description>[8:8] Sets the state of the pin that is configured as DIO#21, if the corresponding DOE31_0 bitfield is set.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>[7:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>DIO20</name>
              <description>[0:0] Sets the state of the pin that is configured as DIO#20, if the corresponding DOE31_0 bitfield is set.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>DOUT27_24</name>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <description>Data Out 24 to 27

Alias register for byte access to each bit in DOUT31_0</description>
          <fields>
            <field>
              <name>RESERVED25</name>
              <description>[31:25] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>25</bitOffset>
            </field>
            <field>
              <name>DIO27</name>
              <description>[24:24] Sets the state of the pin that is configured as DIO#27, if the corresponding DOE31_0 bitfield is set.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>RESERVED17</name>
              <description>[23:17] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>17</bitOffset>
            </field>
            <field>
              <name>DIO26</name>
              <description>[16:16] Sets the state of the pin that is configured as DIO#26, if the corresponding DOE31_0 bitfield is set.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>RESERVED9</name>
              <description>[15:9] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>DIO25</name>
              <description>[8:8] Sets the state of the pin that is configured as DIO#25, if the corresponding DOE31_0 bitfield is set.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>[7:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>DIO24</name>
              <description>[0:0] Sets the state of the pin that is configured as DIO#24, if the corresponding DOE31_0 bitfield is set.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>DOUT31_28</name>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <description>Data Out 28 to 31

Alias register for byte access to each bit in DOUT31_0</description>
          <fields>
            <field>
              <name>RESERVED25</name>
              <description>[31:25] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>25</bitOffset>
            </field>
            <field>
              <name>DIO31</name>
              <description>[24:24] Sets the state of the pin that is configured as DIO#31, if the corresponding DOE31_0 bitfield is set.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>RESERVED17</name>
              <description>[23:17] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>17</bitOffset>
            </field>
            <field>
              <name>DIO30</name>
              <description>[16:16] Sets the state of the pin that is configured as DIO#30, if the corresponding DOE31_0 bitfield is set.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>RESERVED9</name>
              <description>[15:9] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>DIO29</name>
              <description>[8:8] Sets the state of the pin that is configured as DIO#29, if the corresponding DOE31_0 bitfield is set.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>[7:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>DIO28</name>
              <description>[0:0] Sets the state of the pin that is configured as DIO#28, if the corresponding DOE31_0 bitfield is set.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
